/*
 * Написать функцию, принимающую в качестве параметров имя, фамилию и отчество, и возвращающую инициалы в 
 * формате "Ф.И.О." Учесть, что входные параметры могут быть в любом регистре, а результирующая строка должна быть в верхнем.
 */

public class Task4_3{
  
    public static void main(String[] args){
    
        System.out.print("Enter your family, name and last name: ");    
        Scanner scanner = new Scanner(System.in);
        String enterFIO = scanner.nextLine;
    }  
}
